TerpDAC/MicrophoneControllerCode/ESP8266_AS_ARDUINO_PROTOTYPE_FTEST/WiFiConn.cpp
#include <ESP8266WiFi.h>
#include "WiFiConfig.h"
#include "WiFiConn.h"
#include "Time.h"
#include "config.h"

int value = 0;
const char* host = "www.example.com";
int wifiEnabled = 0;
byte mac[6];                     // the MAC address of your Wifi shield

/* Ask the ESP8266 to deep sleep for the specified amount of seconds. */
void espDeepSleep(uint32_t sec) {
  Serial.print("Triggering deep sleep for ");
  Serial.print(sec);
  Serial.println(" seconds...");
  wifiDisable();
  ESP.deepSleep(sec * 1000000);
}

/* Ask the ESP8266 to sleep for the specified amount of seconds. */
void espSleep(uint32_t sec) {
  Serial.print("Triggering sleep for ");
  Serial.print(sec);
  Serial.println(" seconds...");
  wifiDisable();
  delay(sec * 1000);
}

/* Connect to WiFi! */
void connectToWiFi() {
  Serial.println();
  Serial.println();
  Serial.print("Connecting to ");
  Serial.println(ssid);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);
  
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
    
    if (WiFi.status() == WL_SCAN_COMPLETED) {
      Serial.println("Scan completed");
    }

    if (WiFi.status() == WL_CONNECTION_LOST) {
      Serial.println("Connection lost");
    }
    
    if (WiFi.status() == WL_IDLE_STATUS) {
      Serial.println("Idle");
    }

    if (WiFi.status() == WL_NO_SSID_AVAIL) {
      Serial.println("Could not find SSID");
    }
    
    if (WiFi.status() == WL_CONNECT_FAILED) {
      Serial.println("Failed to connect to WiFi!");
    }
  }
 
  Serial.println("");
  Serial.println("WiFi connected");  
  Serial.println("IP address: ");
  Serial.println(WiFi.localIP());

  WiFi.macAddress(mac);
  Serial.print("MAC: ");
  Serial.print(mac[5],HEX);
  Serial.print(":");
  Serial.print(mac[4],HEX);
  Serial.print(":");
  Serial.print(mac[3],HEX);
  Serial.print(":");
  Serial.print(mac[2],HEX);
  Serial.print(":");
  Serial.print(mac[1],HEX);
  Serial.print(":");
  Serial.println(mac[0],HEX);
  
  wifiEnabled = 1;
}

/* Test WiFi by grabbing a webpage. */
void wifiTest() {
  Serial.print("performing wifi test in 5s...");
  delay(5000);
  ++value;
 
  Serial.print("connecting to ");
  Serial.println(host);
  
  // Use WiFiClient class to create TCP connections
  WiFiClient client;
  const int httpPort = 80;
  if (!client.connect(host, httpPort)) {
    Serial.println("connection failed");
    return;
  }
  
  // We now create a URI for the request
  //String url = "/testwifi/index.html";
  String url = "/";
  Serial.print("Requesting URL: ");
  Serial.println(url);
  
  // This will send the request to the server
  client.print(String("GET ") + url + " HTTP/1.1\r\n" +
               "Host: " + host + "\r\n" + 
               "Connection: close\r\n\r\n");
  delay(500);
  
  // Read all the lines of the reply from server and print them to Serial
  while(client.available()){
    String line = client.readStringUntil('\r');
    Serial.print(line);
  }
  
  Serial.println();
  Serial.println("closing connection");
}

/* Disable WiFi. */
void wifiDisable() {
  Serial.println("Disconnecting from WiFi and disabling...");
  WiFi.disconnect();
  WiFi.mode(WIFI_OFF);
  delay(100);
  WiFi.forceSleepBegin();
  delay(100);
  wifiEnabled = 0;
}

/* Enable WiFi. */
void wifiEnable() {
  Serial.println("Enabling WiFi...");
  WiFi.forceSleepWake();
  delay(100);
  WiFi.mode(WIFI_STA);
  delay(100);
  /* Note that wifiEnabled = 1 is set within connectToWiFi(). */
  connectToWiFi();
}

/* Return if WiFi is enabled or not. */
int getWiFiEnabled() {
  return wifiEnabled;
}

/* Submit the data to the MicSense server, given the time number,
 * number of total samples taken, number of high samples detected, and
 * number of mid samples detected.
 */
void submitSum(uint32_t curTime, long totalSampleCount, long highTotalCount, long midTotalCount) {
  Serial.println("Submit code goes here!");

  // Use WiFiClient class to create TCP connections
  WiFiClient client;
  
  // WiFi MAC address should be populated at this point!
  
  if (client.connect(server, 80)) {
    Serial.println("connected to server");
#ifdef ENABLE_DEBUG_SERIAL
    // Print out the request we're going to send!
    Serial.print("GET /datasubmit?id=");
    Serial.print(mac[5],HEX);
    Serial.print(mac[4],HEX);
    Serial.print(mac[3],HEX);
    Serial.print(mac[2],HEX);
    Serial.print(mac[1],HEX);
    Serial.print(mac[0],HEX);
    Serial.print("&d=");
    Serial.print(now());
    Serial.print(",");
    Serial.print(highTotalCount);
    Serial.print(",");
    Serial.print(midTotalCount);
    Serial.print(",");
    Serial.print(totalSampleCount - (highTotalCount + midTotalCount));
    Serial.println(" HTTP/1.1");
    Serial.print("Host: ");
    Serial.println(server);
    Serial.println("Connection: close");
    Serial.println();
#endif
    
    // Make a HTTP request:
    client.print("GET /datasubmit?id=");
    client.print(mac[5],HEX);
    client.print(mac[4],HEX);
    client.print(mac[3],HEX);
    client.print(mac[2],HEX);
    client.print(mac[1],HEX);
    client.print(mac[0],HEX);
    client.print("&d=");
    client.print(now());
    client.print(",");
    client.print(highTotalCount);
    client.print(",");
    client.print(midTotalCount);
    client.print(",");
    client.print(totalSampleCount - (highTotalCount + midTotalCount));
    client.println(" HTTP/1.1");
    client.print("Host: ");
    client.println(server);
    client.println("Connection: close");
    client.println();
    client.println("Connection: close\r\n\r\n");

    Serial.println("all data sent");
    // Read all the lines of the reply from server and print them to Serial
    while(client.available()){
      String line = client.readStringUntil('\r');
      Serial.print(line);
      // SenseOK:#:#
      if (line.find("SenseOK") != std::string::npos) {
        // Attempt to parse the line for any updates to the mid thresh
        // and high thresh
        if (line.length() > 8) {
          size_t mid_thresh_str_end = line.find(":", 9);
          String mid_thresh_str;
          String high_thresh_str;
          int mid_thresh_tmp = -1;
          int high_thresh_tmp = -1;
          
          // Did we find our colon?
          if (mid_thresh_str_end != std::string::npos) {
            // Split the strings up!
            mid_thresh_str = line.substr(9, mid_thresh_str_end -1 - 9 + 1);
            high_thresh_str = line.substr(mid_thresh_str_end + 1, line.length() - (mid_thresh_str_end + 1) + 1);
            try {
              mid_thresh_tmp = std::stoi(mid_thresh_str);
              high_thresh_tmp = std::stoi(high_thresh_str);
            } catch (const std::invalid_argument& ia) {
              // std::stoi will throw an exception if it can't convert,
              // so handle it here.
              Serial.println("Invalid argument: " + ia.what() + '\n');
            }
            if (mid_thresh_tmp != -1) mid_thresh = mid_thresh_tmp;
            if (high_thresh_tmp != -1) high_thresh = high_thresh_tmp;
          }
        }
      }
    }
    
    Serial.println();
    Serial.println("closing connection");
  }
}

void getCalibration() {
  Serial.println("Submit code goes here!");

  // Use WiFiClient class to create TCP connections
  WiFiClient client;
  
  WiFi.macAddress(mac);
  
  if (client.connect(server, 80)) {
    Serial.println("connected to server");
#ifdef ENABLE_DEBUG_SERIAL
    // Print out the request we're going to send!
    Serial.print("GET /calibration?id=");
    Serial.print(mac[5],HEX);
    Serial.print(mac[4],HEX);
    Serial.print(mac[3],HEX);
    Serial.print(mac[2],HEX);
    Serial.print(mac[1],HEX);
    Serial.print(mac[0],HEX);
    Serial.println(" HTTP/1.1");
    Serial.print("Host: ");
    Serial.println(server);
    Serial.println("Connection: close");
    Serial.println();
#endif
    
    // Make a HTTP request:
    client.print("GET /datasubmit?id=");
    client.print(mac[5],HEX);
    client.print(mac[4],HEX);
    client.print(mac[3],HEX);
    client.print(mac[2],HEX);
    client.print(mac[1],HEX);
    client.print(mac[0],HEX);
    client.println(" HTTP/1.1");
    client.print("Host: ");
    client.println(server);
    client.println("Connection: close");
    client.println();
    client.println("Connection: close\r\n\r\n");

    Serial.println("all data sent");
    // Read all the lines of the reply from server and print them to Serial
    while(client.available()){
      String line = client.readStringUntil('\r');
      Serial.print(line);
      // SenseOK:#:#
      if (line.find("SenseOK") != std::string::npos) {
        // Attempt to parse the line for any updates to the mid thresh
        // and high thresh
        if (line.length() > 8) {
          size_t mid_thresh_str_end = line.find(":", 9);
          String mid_thresh_str;
          String high_thresh_str;
          int mid_thresh_tmp = -1;
          int high_thresh_tmp = -1;
          
          // Did we find our colon?
          if (mid_thresh_str_end != std::string::npos) {
            // Split the strings up!
            mid_thresh_str = line.substr(9, mid_thresh_str_end -1 - 9 + 1);
            high_thresh_str = line.substr(mid_thresh_str_end + 1, line.length() - (mid_thresh_str_end + 1) + 1);
            try {
              mid_thresh_tmp = std::stoi(mid_thresh_str);
              high_thresh_tmp = std::stoi(high_thresh_str);
            } catch (const std::invalid_argument& ia) {
              // std::stoi will throw an exception if it can't convert,
              // so handle it here.
              Serial.println("Invalid argument: " + ia.what() + '\n');
            }
            if (mid_thresh_tmp != -1) mid_thresh = mid_thresh_tmp;
            if (high_thresh_tmp != -1) high_thresh = high_thresh_tmp;
          }
        }
      }
    }
    
    Serial.println();
    Serial.println("closing connection");
  }
}
